function getChapterList(name) {
  const context = {}
  let url =
  console.log('`../assets/${name}`', `../assets/${name}`);
  let req
  if(name === 'book1') {
    req = require.context(`../assets/book1`, true, /.mp3$/);
  }else {
    req = require.context(`../assets/book2`, true, /.mp3$/);
  }
  let nameList = req.keys().map(key => {
    let name = key.match(/([a-zA-Z0-9].*)$/)[1];
    return name
  });
  let book1 = [
    '01-长河军民反清乡旧址-4m44',
    '02-林坚烈士牺牲处旧址-5m55',
    '03-良城里秘密联络点-6m58',
    '04-长河党建基地鼎丰裕-9m01',
    '05-十二乡镇长会议旧址-6m09',
    '06-暂三纵修械组暂驻地（长河农民吃大户旧址）金生大-5m',
    '07-长河第一个党支部成立处旧址-12m51',
    '08-暂三纵电台流动到长河-2m19.mp3',
    '09-中和区委旧址-2m58',
    '10-周朝镇战时合作社率先成立旧址-4m54',
    '11-周朝镇战时妇女合作社旧址-3m19',
    '12-余姚县战时合作社联合社旧址-10m44',
    '13-杨肖群烈士旧宅-5m53',
    '14-揭露乡保长兵役舞弊旧址-1m31',
    '15-红色诊所旧址-7m27',
    '16-杨贤江纪念馆-3m10',
    '17-白皮红心保长掩护五支队战士旧址-3m02',
    '18-暂三纵下垫桥打击土匪陈阿二势力旧址-4m21',
    '19-张越钟烈士墓地-4m47',
    '20-大胜庵议租旧址-2m21',
    '21-不一般的兄弟会-4m01',
    '22-大云的红色家庭-7m53',
    '23-大云乡成立缉私-2m19',
    '24-打海底枪笆-9m40',
    '25-大云乡的反撤佃夺地斗争-5m57',
    '26-大云乡战时合作旧址-3m47',
    '27-反对克扣盐斤的斗争-2m43',
    '28-反滥抽壮丁的斗争-4m59',
    '29-公审恶霸地主冯金标旧址-3m41',
    '30-恢复卤晶原价的斗争-3m25',
    '31-平凡烈士牺牲处旧址-1m59',
    '32-三塘剿匪-5m18',
    '33-潭海乡战时合作社旧址-5m33',
    '34-盐民吃大户旧址-3m55',
    '35-余姚中心县委党员骨干培训-3m37',
    '36-镇海殿旧址-6m05',
    '37-张尧忠脱险处旧址-4m',
    '38-笫一次反顽战斗临时指挥部-7m41',
  ]
  return name === 'book1' ? book1 : nameList
}


export default {
  getChapterList
}
